{
  "project": [
    {
      "title": "StreamVibe",
      "description": "Your gateway to trending movies and TV shows. A modern, responsive web app built with React (and TMDB API) that lets users explore trending, top-rated, and upcoming movies and series. Features include real-time data fetching, search functionality, and a clean user interface designed for smooth navigation and discovery.",
      "year": 2025,
      "role": "Front-end Developer",
      "image": "/StreamVibe.png",
      "githubRepo": "https://github.com/EgzonBllacaa/StreamVibe",
      "live": "https://stream-vibe-k4e334po5-egzonbllacaas-projects.vercel.app/"
    },
    {
      "title": "Photography Portfolio",
      "description": "A stunning portfolio template for modern photographers, Snapfolio is a clean, responsive portfolio website designed to showcase photography work in an elegant and visually captivating layout. It includes smooth image galleries, fullscreen previews, and a minimal UI that puts the focus on the visuals. Perfect for freelancers, professional photographers, or visual artists looking to make a lasting impression.",
      "client": "World News",
      "year": 2025,
      "role": "Front-end Developer",
      "image": "/Photography-Portfolio.png",
      "githubRepo": "https://github.com/EgzonBllacaa/Riard-Portfolio",
      "live": "https://portfolio-page-ebon-three.vercel.app/"
    },
    {
      "title": "ShopEase Landing Page",
      "description": "A sleek, modern landing page for online stores. ShopEase is a fully responsive e-commerce landing page crafted with HTML, CSS, and JavaScript. Designed to highlight products effectively with clean layouts, engaging call-to-actions, and smooth animations. Ideal for startups or brands looking to showcase their products and drive conversions.",
      "year": 2022,
      "role": "Front-end Developer",
      "image": "/Ecommerce.png",
      "githubRepo": "https://github.com/EgzonBllacaa/E-commerce",
      "live": "https://e-commerce-tawny-one-57.vercel.app/"
    }
  ],
  "about": {
    "title": "About me",
    "description": {
      "header": "I'm a front-end developer based in Prishtina, passionate about building intuitive and accessible web experiences.",
      "body": "My journey into development began with a focused course, where I quickly gained a strong foundation in HTML, CSS, and JavaScript and for a framework I studied ReactJS. Since then, I've deepened my skills through extensive self-study and hands-on coding, culminating in a portfolio that showcases my capabilities. My projects include a news website demonstrating API integration, a dynamic movie blog with search and filtering functionalities, and an e-commerce site powered by Strapi headless CMS and Stripe payment integration. I'm constantly eager to learn more and tackle new challenges in the front-end space."
    }
  },
  "capabilities": {
    "title": "My Capabilities",
    "description": {
      "header": "I'm proficient in skills below, with a continuous drive to learn. My goal is to consistently grow my skillset, adding new technologies and deeper expertise every month. ",
      "body": [
        "Html",
        "Css",
        "JavaScript",
        "ReactJS",
        "Tailwind css",
        "Node.js",
        "Express.js"
      ]
    }
  }
}
